In [1]:
import pandas as pd
import numpy as np

In [10]:
pd.__version__

'0.24.2'

In [9]:
#读取csv文件
df = pd.read_csv("F:\datawhale\data\\table.csv")

In [11]:
df.head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [12]:
#读取txt文件
df_txt = pd.read_table('F:\datawhale\data\\table.txt')

E:\Anaconda3\envs\tensorflow\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: read_table is deprecated, use read_csv instead, passing sep='\t'.

In [13]:
df_txt

   col1 col2  col3    col4
0     2    a   1.4   apple
1     3    b   3.4  banana
2     6    c   2.5  orange
3     5    d   3.2   lemon

In [15]:
#读取xls或xlsx格式
df_excel = pd.read_excel('F:\datawhale\data\\table.xlsx')

### 2.写入
#### (a) csv格式

In [16]:
df.to_csv('F:\datawhale\data\\new_table.csv')# index=False 保存时去掉行索引

#### (b)xls或xlsx格式

In [17]:
df.to_excel('F:\datawhale\data\\new_table2.xlsx',sheet_name='Sheet1')

## 二、基本数据结构
### 1.Series
#### (a)创建一个Series

In [18]:
s = pd.Series(np.random.randn(5),index=['a','b','c','d','e'],name = '这是一个Series',dtype="float64")

In [19]:
s

a   -1.548738
b    1.079588
c   -1.185421
d   -1.069874
e   -1.462311
Name: 这是一个Series, dtype: float64

In [20]:
#三个属性values\index\name\dtype

print('s.values',s.values)
print('s.name',s.name)
print('s.index',s.index)
print('s.dtype',s.dtype)

s.values [-1.54873838  1.07958841 -1.18542113 -1.06987364 -1.4623112 ]
s.name 这是一个Series
s.index Index(['a', 'b', 'c', 'd', 'e'], dtype='object')
s.dtype float64

In [21]:
#取出某一个元素
s['a']

-1.54873837753217

In [22]:
s[0]

-1.54873837753217

In [23]:
s.mean()

-0.8373511872411912

### 2.DataFrame
#### (a) 创建一个DataFrame

In [25]:
df = pd.DataFrame({'col1':list('abcde'),'col2':range(5,10),'col3':[1.3,2.5,3.6,4.6,5.8]}
                  ,index = list('一二三四五'))
df

  col1  col2  col3
一    a     5   1.3
二    b     6   2.5
三    c     7   3.6
四    d     8   4.6
五    e     9   5.8

#### (b)从DataFrame取出一列为Series

In [26]:
df['col1']

一    a
二    b
三    c
四    d
五    e
Name: col1, dtype: object

In [27]:
type(df['col1'])

pandas.core.series.Series

In [29]:
type(df)

pandas.core.frame.DataFrame

#### (c)修改行或列名
inplace表示在原数据集上修改，默认为False

In [30]:
df.rename(index = {'一':'one'},columns={'col1':'new_col1'})#inplace表示在原数据集上修改，默认为False

    new_col1  col2  col3
one        a     5   1.3
二          b     6   2.5
三          c     7   3.6
四          d     8   4.6
五          e     9   5.8

#### (d)调用属性和方法

In [31]:
df.index

Index(['一', '二', '三', '四', '五'], dtype='object')

In [32]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [33]:
df.values

array([['a', 5, 1.3],
       ['b', 6, 2.5],
       ['c', 7, 3.6],
       ['d', 8, 4.6],
       ['e', 9, 5.8]], dtype=object)

In [36]:
df.mean(axis=1)#axis = 0从上到下，=1从左到右，数据类型求平均

一    3.15
二    4.25
三    5.30
四    6.30
五    7.40
dtype: float64

#### (e)索引对齐特性

In [38]:
df1 = pd.DataFrame({'A':[1,2,3]},index = [1,2,3])
df1

   A
1  1
2  2
3  3

In [39]:
df2 = pd.DataFrame({'A':[1,2,3]},index = [3,1,2])
df2

   A
3  1
1  2
2  3

In [40]:
df1 - df2 #1-2,2-3,3-1

   A
1 -1
2 -1
3  2

In [42]:
#列的删除与添加
df.drop(index='五',columns='col1')#需要设置inplace参数才可以在元数据上删除

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6

In [47]:
df['col1']=[1,2,3,4,5]

In [48]:
del df['col1'] #del直接在原数据上删除
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

### pop方法直接在原来的DataFrame上操作，且返回被删除的列，与python中的pop函数类似¶

In [49]:
df['col1']=[1,2,3,4,5]
df.pop('col1')

一    1
二    2
三    3
四    4
五    5
Name: col1, dtype: int64

In [50]:
df

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [53]:
df1['B'] = list('abc')
df1

   A  B
1  1  a
2  2  b
3  3  c

In [54]:
df1.assign(C=pd.Series(list('def')))

   A  B    C
1  1  a    e
2  2  b    f
3  3  c  NaN

### 根据类型选择列

In [56]:
df.select_dtypes(include=['number']).head()

   col2  col3
一     5   1.3
二     6   2.5
三     7   3.6
四     8   4.6
五     9   5.8

In [57]:
df.select_dtypes(include=['float']).head()

   col3
一   1.3
二   2.5
三   3.6
四   4.6
五   5.8

In [66]:
s = df.mean()
s.name='to_DataFrame'
s

col2    7.00
col3    3.56
Name: to_DataFrame, dtype: float64

In [67]:
s.to_frame()

      to_DataFrame
col2          7.00
col3          3.56

In [69]:
s.to_frame().T

              col2  col3
to_DataFrame   7.0  3.56

## 三、常用基本函数

In [70]:
df = pd.read_csv("F:\datawhale\data\\table.csv")

In [82]:
#head和tail 
df.head(10)#前5行数据 也可以设置n=..

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M  street_1     173      63  34.0      A+
1    S_1   C_1  1102      F  street_2     192      73  32.5      B+
2    S_1   C_1  1103      M  street_2     186      82  87.2      B+
3    S_1   C_1  1104      F  street_2     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+
5    S_1   C_2  1201      M  street_5     188      68  97.0      A-
6    S_1   C_2  1202      F  street_4     176      94  63.5      B-
7    S_1   C_2  1203      M  street_6     160      53  58.8      A+
8    S_1   C_2  1204      F  street_5     162      63  33.8       B
9    S_1   C_2  1205      F  street_6     167      63  68.4      B-

In [72]:
df.tail()

   School Class    ID Gender   Address  Height  Weight  Math Physics
30    S_2   C_4  2401      F  street_2     192      62  45.3       A
31    S_2   C_4  2402      M  street_7     166      82  48.7       B
32    S_2   C_4  2403      F  street_6     158      60  59.7      B+
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
34    S_2   C_4  2405      F  street_6     193      54  47.6       B

### 2.unique 和 nunique

In [73]:
#nunique = number of unique
df['Physics'].nunique()

7

In [74]:
#unique显示所有的唯一值
df.Physics.unique()

array(['A+', 'B+', 'B-', 'A-', 'B', 'A', 'C'], dtype=object)

### 3.count和value_counts
#### count返回非缺失值元素个数

In [75]:
df.Physics.count()

35

In [76]:
#返回每个元素有多少个
df.Physics.value_counts()

B+    9
B     8
B-    6
A     4
A+    3
A-    3
C     2
Name: Physics, dtype: int64

## 4.describe和info

In [77]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 9 columns):
School     35 non-null object
Class      35 non-null object
ID         35 non-null int64
Gender     35 non-null object
Address    35 non-null object
Height     35 non-null int64
Weight     35 non-null int64
Math       35 non-null float64
Physics    35 non-null object
dtypes: float64(1), int64(3), object(5)
memory usage: 2.5+ KB

In [78]:
df.describe()

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
max    2405.00000  195.000000  100.000000  97.000000

### 可以自行选择分位数

In [79]:
df.describe(percentiles=[.05,.25,.75,.95])

               ID      Height      Weight       Math
count    35.00000   35.000000   35.000000  35.000000
mean   1803.00000  174.142857   74.657143  61.351429
std     536.87741   13.541098   12.895377  19.915164
min    1101.00000  155.000000   53.000000  31.500000
5%     1102.70000  157.000000   56.100000  32.640000
25%    1204.50000  161.000000   63.000000  47.400000
50%    2103.00000  173.000000   74.000000  61.700000
75%    2301.50000  187.500000   82.000000  77.100000
95%    2403.30000  193.300000   97.600000  90.040000
max    2405.00000  195.000000  100.000000  97.000000

In [80]:
df.Physics.describe()

count     35
unique     7
top       B+
freq       9
Name: Physics, dtype: object

### 5.idxmax和nlargest
idxmax函数返回最大值索引，在某些情况下特别适用，idxmin功能类似

nlargest函数返回前几个大的元素值，nsmallest功能类似

In [81]:
df.Math.idxmax()

5

In [84]:
df.Math.nlargest(3)

5     97.0
28    95.5
11    87.7
Name: Math, dtype: float64

### 6.clip和replace
#### 是替换类函数
#### clip是对超过或者低于某些值的数进行截断

In [85]:
df.Math.head()

0    34.0
1    32.5
2    87.2
3    80.4
4    84.8
Name: Math, dtype: float64

In [87]:
df['Math'].clip(33,81).head()#对于不满足条件的数据进行替换

0    34.0
1    33.0
2    81.0
3    80.4
4    81.0
Name: Math, dtype: float64

In [88]:
df['Address'].head()

0    street_1
1    street_2
2    street_2
3    street_2
4    street_4
Name: Address, dtype: object

In [89]:
df['Address'].replace(['street_1','street_2'],['one','two']).head()

0         one
1         two
2         two
3         two
4    street_4
Name: Address, dtype: object

In [90]:
df['Address'].head()

0    street_1
1    street_2
2    street_2
3    street_2
4    street_4
Name: Address, dtype: object

In [91]:
df.replace({'Address':{'street_1':'one','street_2':'two'}}).head()

  School Class    ID Gender   Address  Height  Weight  Math Physics
0    S_1   C_1  1101      M       one     173      63  34.0      A+
1    S_1   C_1  1102      F       two     192      73  32.5      B+
2    S_1   C_1  1103      M       two     186      82  87.2      B+
3    S_1   C_1  1104      F       two     167      81  80.4      B-
4    S_1   C_1  1105      F  street_4     159      64  84.8      B+

In [92]:
df['Math'].apply(lambda x:str(x)+'!').head()

0    34.0!
1    32.5!
2    87.2!
3    80.4!
4    84.8!
Name: Math, dtype: object

In [100]:
#对于DataFrame，它可以迭代每一个列操作
df.apply(lambda x:x.apply(lambda x:str(x)+'!')).head()

  School Class     ID Gender    Address Height Weight   Math Physics
0   S_1!  C_1!  1101!     M!  street_1!   173!    63!  34.0!     A+!
1   S_1!  C_1!  1102!     F!  street_2!   192!    73!  32.5!     B+!
2   S_1!  C_1!  1103!     M!  street_2!   186!    82!  87.2!     B+!
3   S_1!  C_1!  1104!     F!  street_2!   167!    81!  80.4!     B-!
4   S_1!  C_1!  1105!     F!  street_4!   159!    64!  84.8!     B+!

In [101]:
df.set_index('Math').head()

     School Class    ID Gender   Address  Height  Weight Physics
Math
34.0    S_1   C_1  1101      M  street_1     173      63      A+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
87.2    S_1   C_1  1103      M  street_2     186      82      B+
80.4    S_1   C_1  1104      F  street_2     167      81      B-
84.8    S_1   C_1  1105      F  street_4     159      64      B+

In [102]:
df.set_index('Math').sort_index().head()

     School Class    ID Gender   Address  Height  Weight Physics
Math
31.5    S_1   C_3  1301      M  street_4     161      68      B+
32.5    S_1   C_1  1102      F  street_2     192      73      B+
32.7    S_2   C_3  2302      M  street_5     171      88       A
33.8    S_1   C_2  1204      F  street_5     162      63       B
34.0    S_1   C_1  1101      M  street_1     173      63      A+

In [103]:
#值排序

df.sort_values(by='Class').head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
19    S_2   C_1  2105      M  street_4     170      81  34.2       A
18    S_2   C_1  2104      F  street_5     159      97  72.2      B+
16    S_2   C_1  2102      F  street_6     161      61  50.6      B+
15    S_2   C_1  2101      M  street_7     174      84  83.3       C

In [104]:
#多个值排序，即先对第一层排，在第一层相同的情况下对第二层排序

df.sort_values(by=['Address','Height']).head()

   School Class    ID Gender   Address  Height  Weight  Math Physics
0     S_1   C_1  1101      M  street_1     173      63  34.0      A+
11    S_1   C_3  1302      F  street_1     175      57  87.7      A-
23    S_2   C_2  2204      M  street_1     175      74  47.2      B-
33    S_2   C_4  2404      F  street_2     160      84  67.7       B
3     S_1   C_1  1104      F  street_2     167      81  80.4      B-